/**
 * Серверный код модуля JetCalc, обеспечивающий создание и публикацию экономических моделей
 * @version 0.0.1
 * @author Сергеев Сергей Юрьевич
 * @license MIT License 
 * @requires JetCalc
 */
var MModelStore = (new function() {
    // инициализация модуля
    var self = new Module("modelstore");

    /**
     ********************************************************************
     * Определение собственных наблюдаемых элементов
     ********************************************************************
     */

    self.InputString = ko.observable();
    

    /**
     ********************************************************************
     * Реализация стандертного интерфейса модуля
     ********************************************************************
     */


    /**
     * Настройка доступности модуля в зависимости от пров доступа
     */
    self.IsAvailable = function(){
        return PermChecker.CheckPrivelege("IsMakedemo");
    }

    /**
     * Дополнительная обработка перед отрисовкой модуля
     */
    self.BeforeShow = function(){
        self.Show();
    }


    /**
     * Сохранение сделанных изменений
     */
    self.SaveChanges = function(){

    }


    /**
     * Отрисовка модуля
     * @param done
     */
    self.Show = function(done){
        if (!self.Mode()) return self.InitSetMode("MakeDemo");
        switch (self.Mode()){
            case "MakeDemo":
                //ModelTableEdit.InitModel("sumgrp");
                self.InputString("Строка, выводимая в консоль браузера");
            break;            
        }
        return done && done()
    }

    /**
     ********************************************************************
     * Вспомогательные функции
     ********************************************************************
     */


    /**
     * Функция тестирования привязки
     */
    self.LogTest = function(){
        console.log("Строка в поле ввода: '"+self.InputString()+"'");
    }

    
    /**
     ********************************************************************
     * Возврат из функции-конструктора созданного объекта
     ********************************************************************
     */
    return self;
})

/**
 * Подключение модуля ModelStore к менеджеру модулей
 */
ModuleManager.Modules.ModelStore = MModelStore;
