var data = [{
    "name": "2013",
    "Здания": 6,
    "Сооружения": 85,
    "Машини и оборудование": 35,
    "Транспортные средства": 0,
    "Прочие осн. средства": 1
}, {
    "name": "1 кв. 2014",
    "Здания": 6,
    "Сооружения": 92,
    "Машини и оборудование": 33,
    "Транспортные средства": 0,
    "Прочие осн. средства": 1
}, {
    "name": "1 пг. 2014",
    "Здания": 6,
    "Сооружения": 89,
    "Машини и оборудование": 32,
    "Транспортные средства": 0,
    "Прочие осн. средства": 1
}, {
    "name": "9 мес. 2014",
    "Здания": 6,
    "Сооружения": 87,
    "Машини и оборудование": 30,
    "Транспортные средства": 2,
    "Прочие осн. средства": 1
}]
