var data = [ {
	"key": "Здания",
	"values": [ {
		"x": "2013",
		"y": 6
	}, {
		"x": "1 кв. 2014",
		"y": 6
	}, {
		"x": "1 пг. 2014",
		"y": 6
	}, {
		"x": "9 мес. 2014",
		"y": 6
	} ]
}, {
	"key": "Сооружения",
	"values": [ {
		"x": "2013",
		"y": 85
	}, {
		"x": "1 кв. 2014",
		"y": 92
	}, {
		"x": "1 пг. 2014",
		"y": 68
	}, {
		"x": "9 мес. 2014",
		"y": 87
	} ]
}, {
	"key": "Машины и оборудование",
	"values": [ {
		"x": "2013",
		"y": 35
	}, {
		"x": "1 кв. 2014",
		"y": 33
	}, {
		"x": "1 пг. 2014",
		"y": 32
	}, {
		"x": "9 мес. 2014",
		"y": 30
	} ]
}, {
	"key": "Транспортные средства",
	"values": [ {
		"x": "2013",
		"y": 0
	}, {
		"x": "1 кв. 2014",
		"y": 0
	}, {
		"x": "1 пг. 2014",
		"y": 0
	}, {
		"x": "9 мес. 2014",
		"y": 2
	} ]
}, {
	"key": "Прочие осн. средства",
	"values": [ {
		"x": "2013",
		"y": 1
	}, {
		"x": "1 кв. 2014",
		"y": 1
	}, {
		"x": "1 пг. 2014",
		"y": 1
	}, {
		"x": "9 мес. 2014",
		"y": 1
	} ]
} ]
